export const indoor_prompt = [
  {
    category: {
      zh: '墙面材质',
      en: '墙面材质',
    },
    subcategories: [
      {
        zh: '瓷砖墙面',
        en: '瓷砖墙面',
      },
      {
        zh: '木墙装饰',
        en: '木墙装饰',
      },
      {
        zh: '涂料墙面',
        en: '涂料墙面',
      },
      {
        zh: '石材墙面',
        en: '石材墙面',
      },
      {
        zh: '墙纸墙面',
        en: '墙纸墙面',
      },
    ],
  },
  {
    category: {
      zh: '地面材质',
      en: '地面材质',
    },
    subcategories: [
      {
        zh: '木地板',
        en: '木地板',
      },
      {
        zh: '瓷砖地板',
        en: '瓷砖地板',
      },
      {
        zh: '水泥地板',
        en: '水泥地板',
      },
      {
        zh: '大理石地板',
        en: '大理石地板',
      },
      {
        zh: '地毯地板',
        en: '地毯地板',
      },
      {
        zh: '橡胶地板',
        en: '橡胶地板',
      },
      {
        zh: '混泥土地板',
        en: '混泥土地板',
      },
    ],
  },
  {
    category: {
      zh: '空间',
      en: '空间',
    },
    subcategories: [
      {
        zh: '客厅',
        en: '客厅',
      },
      {
        zh: '餐厅',
        en: '餐厅',
      },
      {
        zh: '卧室',
        en: '卧室',
      },
      {
        zh: '卫生间',
        en: '卫生间',
      },
      {
        zh: '厨房',
        en: '厨房',
      },
      {
        zh: '书房',
        en: '书房',
      },
      {
        zh: '衣帽间',
        en: '衣帽间',
      },
    ],
  },
];

export const arch_prompt = [
  {
    category: {
      zh: '材料',
      en: '材料',
    },
    subcategories: [
      {
        zh: '玻璃',
        en: '玻璃',
      },
      {
        zh: '石材',
        en: '石材',
      },
      {
        zh: '木材',
        en: '木材',
      },
      {
        zh: '竹材',
        en: '竹材',
      },
      {
        zh: '钢材',
        en: '钢材',
      },
      {
        zh: '砖石',
        en: '砖石',
      },
      {
        zh: '红砖',
        en: '红砖',
      },
      {
        zh: '灰砖',
        en: '灰砖',
      },
      {
        zh: '瓷砖',
        en: '瓷砖',
      },
      {
        zh: '涂料',
        en: '涂料',
      },
      {
        zh: '瓦片',
        en: '瓦片',
      },
      {
        zh: '夯土',
        en: '夯土',
      },
      {
        zh: '金属板',
        en: '金属板',
      },
      {
        zh: '大理石',
        en: '大理石',
      },
      {
        zh: '混凝土',
        en: '混凝土',
      },
      {
        zh: '膜结构',
        en: '膜结构',
      },
      {
        zh: '抛光混凝土',
        en: '抛光混凝土',
      },
      {
        zh: '清水混凝土',
        en: '清水混凝土',
      },
    ],
  },
  {
    category: {
      zh: '风格',
      en: '风格',
    },
    subcategories: [
      {
        zh: '现代风格',
        en: '现代风格',
      },
      {
        zh: '新中式风格',
        en: '新中式风格',
      },
      {
        zh: '新古典风格',
        en: '新古典风格',
      },
      {
        zh: '欧式风格',
        en: '欧式风格',
      },
      {
        zh: '东南亚风格',
        en: '东南亚风格',
      },
      {
        zh: '极简主义',
        en: '极简主义',
      },
      {
        zh: '粗野风格',
        en: '粗野风格',
      },
      {
        zh: '草原风格',
        en: '草原风格',
      },
      {
        zh: '工业风格',
        en: '工业风格',
      },
      {
        zh: '美式风格',
        en: '美式风格',
      },
      {
        zh: '包豪斯风格',
        en: '包豪斯风格',
      },
      {
        zh: '未来主义',
        en: '未来主义',
      },
      {
        zh: '赛博朋克',
        en: '赛博朋克',
      },
    ],
  },
  {
    category: {
      zh: '结构',
      en: '结构',
    },
    subcategories: [
      {
        zh: '门',
        en: '门',
      },
      {
        zh: '梁',
        en: '梁',
      },
      {
        zh: '窗户',
        en: '窗户',
      },
      {
        zh: '阳台',
        en: '阳台',
      },
      {
        zh: '楼梯',
        en: '楼梯',
      },
      {
        zh: '屋顶',
        en: '屋顶',
      },
      {
        zh: '楼板',
        en: '楼板',
      },
      {
        zh: '柱子',
        en: '柱子',
      },
      {
        zh: '墙体',
        en: '墙体',
      },
      {
        zh: '天花板',
        en: '天花板',
      },
    ],
  },
  {
    category: {
      zh: '形体',
      en: '形体',
    },
    subcategories: [
      {
        zh: '正方体形体大楼',
        en: '正方体形体大楼',
      },
      {
        zh: '长方体形体大楼',
        en: '长方体形体大楼',
      },
      {
        zh: '体块穿透',
        en: '体块穿透',
      },
      {
        zh: '块状堆叠',
        en: '块状堆叠',
      },
      {
        zh: '仿生结构',
        en: '仿生结构',
      },
      {
        zh: '直线形状',
        en: '直线形状',
      },
      {
        zh: '参数化表皮',
        en: '参数化表皮',
      },
      {
        zh: '后台造型',
        en: '后台造型',
      },
      {
        zh: '坡度屋顶造型',
        en: '坡度屋顶造型',
      },
      {
        zh: '三角形',
        en: '三角形',
      },
      {
        zh: '曲线异形大楼',
        en: '曲线异形大楼',
      },
      {
        zh: '圆形形体大楼',
        en: '圆形形体大楼',
      },
      {
        zh: '球形形体大楼',
        en: '球形形体大楼',
      },
      {
        zh: '流线型形体大楼',
        en: '流线型形体大楼',
      },
    ],
  },
];

export const land_prompt = [
  {
    category: {
      zh: '景观材料',
      en: '景观材料',
    },
    subcategories: [
      {
        zh: '石材',
        en: '石材',
      },
      {
        zh: '木材',
        en: '木材',
      },
      {
        zh: '竹材',
        en: '竹材',
      },
      {
        zh: '钢材',
        en: '钢材',
      },
      {
        zh: '砖石',
        en: '砖石',
      },
      {
        zh: '红砖',
        en: '红砖',
      },
      {
        zh: '灰砖',
        en: '灰砖',
      },
      {
        zh: '瓷砖',
        en: '瓷砖',
      },
      {
        zh: '涂料',
        en: '涂料',
      },
      {
        zh: '瓦片',
        en: '瓦片',
      },
      {
        zh: '大理石',
        en: '大理石',
      },
      {
        zh: '金属板',
        en: '金属板',
      },
      {
        zh: '混凝土',
        en: '混凝土',
      },
    ],
  },
  {
    category: {
      zh: '景观单体',
      en: '景观单体',
    },
    subcategories: [
      {
        zh: '木屋',
        en: '木屋',
      },
      {
        zh: '雕塑',
        en: '雕塑',
      },
      {
        zh: '围墙',
        en: '围墙',
      },
      {
        zh: '草坪',
        en: '草坪',
      },
      {
        zh: '石头',
        en: '石头',
      },
      {
        zh: '花坛',
        en: '花坛',
      },
      {
        zh: '游泳池',
        en: '游泳池',
      },
    ],
  },
];
