import Header from '@/components/Header';
import style from './index.less';

export default () => {
  return (
    <>
      <Header />
      <div className={style.container}>
        <div className={style.innerContainer}>
          <h1>EVAI协议</h1>
          <p className={style.title}>导言</p>
          <p>
            欢迎您使用EVAI！为使用EVAI网提供的服务，您应当提前阅读并遵守《EVAI协议》（以下简称“本协议”），以及其他公布在EVAI网的网站规则。
            <br />
            为了您可以更好地使用EVAI网提供的服务，在使用EVAI网前，您需要认真阅读并完全同意本协议条款，并充分理解全部内容，特别是免除或限制责任的条款，该等条款可能以加粗的形式提醒您注意。
            <br />
            除非您提前阅读并接受本协议的条款或内容，否则请您不要使用EVAI网所提供的服务；如您使用了EVAI网所提供的服务，您的使用行为将被视为您已认真阅读且透彻理解并完全同意本协议条款的全部约定，并与EVAI网达成了协议，且承诺遵守。
            <br />
            EVAI网公布的其他法律文本与本协议具有同等法律效力，您承诺接受并遵守上述全部协议的约定。届时您不应以未阅读过本协议而主张您与EVAI网之间的协议无效或要求撤销本协议。
          </p>
          <p className={style.title}>一、协议的范围</p>
          <p>
            （一）协议适用主体范围
            <br />
            本协议是您与EVAI网（包括EVAI网的运营主体南京伊维尔科技有限公司，以下简称“EVAI网”）之间关于您在使用EVAI网提供服务所订立的协议。
            <br />
            <br />
            （二）协议关系及冲突条款
            <br />
            本协议是您使用EVAI网提供服务的主协议
            <br />
            本协议内容同时包含EVAI网可能不断发布的关于用户使用EVAI网提供服务相关的其他协议、业务规则等。上述内容发布后即成为本协议不可分割的组成部分，您应当同样遵守。
            <br />
            本协议可由EVAI网随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站查阅最新版协议条款。若您不接受修改过的条款，请立即停止使用EVAI网提供的服务，您的继续使用将被视为已经接受了修改后的协议。
          </p>
          <p className={style.title}>二、EVAI网提供服务的内容</p>
          <p>
            （一）服务的内容
            <br />
            EVAI网向您提供信息储存和展示平台，支持您上传原创数字作品和展示推广、下载他人的数字作品以及在线分享图片、文字、视频、音频。
            <br />
            <strong>
              同时，EVAI网可能会提供其他网站的链接，除非另有声明，EVAI网无法对其他网站提供的服务进行控制。用户因使用或依赖上述网站产生的损失，EVAI网不承担任何责任。
            </strong>
            <br />
            <br />
            （二）服务的形式
            <br />
            您使用EVAI网需要以可以匹配到您个人身份的方式注册账号，注册完成后您将获得EVAI网账号的使用权利。
            <br />
            对于您在EVAI网上传的数字作品（包括但不限于已经上传的作品和未来将要上传的作品，其形式表现为任何形式的文字、图片、视频、3D模型、SU模型、贴图、CAD图纸等您可以上传到EVAI网的内容），您同意EVAI网在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。EVAI网有权在不另外取得您同意的情况下，在全球范围内，对您的数字作品进行任何形式的使用，包括包括但不限于将您上传的作品向其他用户进行分享、传播、提供付费下载、推广等。同时，您许可EVAI网行使您上传的作品的著作权的全部财产权利，EVAI网将依照平台规则向您支付报酬。
            <br />
            <br />
            （三）服务许可的范围
            <br />
            EVAI网给予您一项个人的、不可转让的以及非排他性的许可，允许您使用EVAI网。您可以在单一终端上登陆您的EVAI网账号，并使用EVAI网提供的服务。本条款及本协议其他条款未明示授权的其他一切权利仍由EVAI网保留，您在行使这些权利时须另外取得EVAI网的书面许可。EVAI网如果未行使前述任何权利，并不构成对该权利的放弃。
            <br />
            <br />
            （四）服务的更新
            <br />
            您理解并同意，根据国家法律法规、监管政策及行业规范变化及服务运营需要，EVAI网有权自行对服务内容进行变更，或中断、中止、终止服务。
            <br />
            如EVAI网发生合并、分立、收购、资产转让时，EVAI网可向第三方转让本服务下相关资产；EVAI网亦可在单方通知您后，将本协议下部分或全部服务及相应的权利义务转交由第三方运营或履行。
            <br />
            如您在使用EVAI网服务时存在违反法律法规、本协议及EVAI网服务条款、社会公德、公序良俗和/或侵害他人合法权益等情形，EVAI网有权不经通知而单方变更、中断或终止向您提供全部或部分服务。
            <br />
            EVAI网终止向您提供服务后，有权根据适用法律的要求删除您的个人信息，或使其匿名化处理，亦有权依照法律规定的期限和方式继续保存您留存于EVAI网的其他内容和信息。
          </p>
          <p className={style.title}>三、用户个人信息保护</p>
          <p>
            （一）保护用户个人信息是EVAI网的一项基本原则，EVAI网将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可EVAI网不会向第三方公开、透露用户个人信息。
            <br />
            <br />
            （二）您在使用EVAI网提供服务的过程中需要提供一些必要的信息，如您在注册账号过程中可能需要提供您的手机号码。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。
          </p>
          <p className={style.title}>四、用户行为规范</p>
          <p>
            （一）信息内容规范
            <br />
            您享有言论自由的权利，但您理解并同意，EVAI网致力于为用户提供文明健康、规范有序的网络环境，
            <strong>
              您不得利用EVAI网及服务制作、复制、发布、传播如下干扰EVAI网正常运营，以及侵犯其他用户或第三方合法权益的内容，
            </strong>
            包括但不限于：
            <br />
            1、发布、传送、传播、储存违反国家法律法规规定的内容：
            <br />
            （1）反对宪法所确定的基本原则的；（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；（3）损害国家荣誉和利益的；（4）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；（5）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；（6）煽动民族仇恨、民族歧视，破坏民族团结的；（7）破坏国家宗教政策，宣扬邪教和封建迷信的；（8）散布谣言，扰乱社会秩序，破坏社会稳定的；（9）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；（10）侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；（11）使用夸张标题，内容与标题严重不符的；（12）炒作绯闻、丑闻、劣迹等的；（13）不当评述自然灾害、重大事故等灾难的；（14）带有性暗示、性挑逗等易使人产生性联想的；（15）展现血腥、惊悚、残忍等致人身心不适的；（16）煽动人群歧视、地域歧视等的；（17）宣扬低俗、庸俗、媚俗内容的；（18）可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的；（19）侵害未成年人合法权益或者损害未成年人身心健康的内容；（20）其他对网络生态造成不良影响的内容。（21）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；（22）以非法民间组织名义活动的；（23）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；（24）法律、行政法规禁止的其他内容的
            <br />
            2、侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；
            <br />
            3、涉及他人隐私、个人信息或资料的；
            <br />
            4、骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；
            <br />
            5、其他违反法律法规、政策及公序良俗、社会公德或干扰EVAI网正常运营和侵犯其他用户或第三方合法权益内容的信息。
            <br />
            如因您发布、传送、传播、储存包含有上述信息的内容导致EVAI网直接或者间接受到任何损害的，EVAI网有权对您的内容、账号等采取处理措施，并向您主张赔偿。对于第三方因您上传的内容向EVAI网主张权利的，EVAI网有权在不事先通知的情况下直接采取删除、屏蔽、断开链接等必要措施。
            <br />
            <br />
            （二）账号使用规范
            <br />
            1、您应对注册获得的账号项下的一切行为承担全部责任，不得实施任何违反法律法规、国家政策、社会公序良俗的行为，不得侵犯包括但不限于EVAI网在内的任何主体的合法权益。
            <br />
            2、您理解并同意，您仅享有账号及账号项下产品及服务的使用权，账号、该等产品及服务的所有权归EVAI网所有（法律法规或EVAI网另有规定的除外）。您不得以任何形式处置账号的使用权（包括但不限于赠与、出借、转让、出售、抵押、继承、许可他人使用）。如果EVAI网发现或者有合理理由认为使用者并非账号注册人，EVAI网有权在不通知您的情况下，暂停或终止向该注册账号提供服务，并注销该账号。
            <br />
            3、您应妥善保管账号信息、账号密码以及其他与账号相关的信息、资料。如因您的原因，造成账号信息、资料、数据的变动、灭失或财产损失等，您应立即通知EVAI网并自行承担相关法律后果。
            <br />
            4、您同意并承诺不从事以下行为：
            <br />
            （1）未使用真实、合法、准确、有效的身份信息注册账号；（2）冒用他人身份信息为自己注册账号；（3）未经他人合法授权以他人名义注册账号；（4）使用侮辱、诽谤、色情、政治等违反法律、道德及公序良俗的词语注册账号；（5）以非法占有EVAI网相关服务资源为目的，通过正当或非正当手段恶意利用网站漏洞注册账号；（6）以侵犯他人合法权益的其他内容、方式和/或手段注册账号；（7）在其他网站上传EVAI网的独家作品。
            <br />
            5、您在使用EVAI网不应从事以下违规行为：
            <br />
            （1）将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；（2）非法侵入、干扰或破坏EVAI网服务或与EVAI网服务相连的服务器、网络等危害网络安全的活动，或提供专门用于从事危害网络安全活动的程序、工具；（3）未经EVAI网事先明确书面许可，以任何方式（包括但不限于机器人软件、蜘蛛软件、爬虫软件等任何自动程序、脚本、软件）和任何理由自行或委托他人、协助他人获取平台的服务、内容、数据；（4）违反法律法规、公序良俗、本协议或EVAI网服务条款及侵犯他人合法权益的其他行为。
            <br />
            6、您理解并同意，如EVAI网发现您存在违反法律法规规定、本协议约定的情形，EVAI网有权视情况采取禁止注册、警示通知、拒绝发布、停止传输信息、删除内容、限制或冻结账号部分或全部功能直至终止提供服务、永久封号等措施。同时，EVAI网有权保存前述违法违规记录，并依法向国家有关机关报告（如向公安机关报案、向网信部门报告）、配合国家有关机关调查等。
          </p>
          <p className={style.title}>五、知识产权及其他权益</p>
          <p>
            （一）若您认为他人EVAI网账号的使用侵犯了您的合法权益，为了EVAI网有效处理上述个人或单位的权利通知，请将以上材料发送至专用邮箱
            <strong style={{ color: 'blue' }}>547951566@qq.com</strong>。
            <br />
            如果权利通知的陈述失实，权利通知提交者将承担对由此造成的全部法律责任（包括但不限于赔偿各种费用及律师费）。
            <br />
            （二）受国际版权公约、中华人民共和国著作权法、专利法、及其他知识产权方面的法律法规的保护，EVAI网及EVAI网为提供服务所使用的软件、技术、商标、材料等的所有知识产权归EVAI网所有和享有。“知识产权”包括在专利法、著作权法、商标法、反不正当竞争法等法律中规定的任何和所有权利、所有权和利益，以及其中的任何和所有应用、更新、扩展和恢复。
            <br />
            （三）您不得恶意修改、复制、传播EVAI网服务所使用的软件、技术、材料等。否则，您应当承担因此而造成对其他人的损害的赔偿责任，且应当承受因此对EVAI网形象损害的赔偿责任。
            <br />
            （四）您不得擅自删除、掩盖或更改EVAI网的版权声明、商标或其它权利声明。EVAI网平台所有设计图样以及其他图样、产品及服务名称，均为EVAI网所享有的商标、标识。任何人不得使用、复制或用作其他用途。
            <br />
            （五）EVAI网所有和享有的知识产权，不因您的任何使用行为而发生权利转移。您在EVAI网所下载的图片、模型等电子数据文件，除非经过EVAI网的书面许可，否则您不得以盈利为目的自己使用或许可其他第三方使用。EVAI网许可您付费下载文件不代表著作权转让，您不得以任何方式复制、销售、发行、传播前述下载文件。
            <br />
            （六）若任何第三方以任何形式侵犯您的版权素材的著作权，您同意并授权EVAI网有权以其独立名义独立进行维权。维权方式包括但不限于：监测侵权行为、发送维权函、刑事举报、行政投诉、提起民事诉讼或仲裁、调解、和解等任何合法方式，EVAI网可对维权事宜做出任何独立决策、独立主张侵权赔偿并独立开展一切维权行动，并有权转授权专业法律服务机构从事上述维权行动。
            <br />
            EVAI网如就前述侵权行为已经或将要发起任何形式的维权行动，由此产生的维权费用由EVAI网先行垫付（包括但不限于：公证费、诉讼费、聘请律师费、鉴定费等）。
            <br />
            <strong>
              EVAI网就前述著作权侵权事宜向第三方进行维权后，您不得就上述著作权侵权纠纷单方面与第三方协商或和解；如有违反，您应赔偿EVAI网由此遭受的全部损失。
            </strong>
          </p>
          <p className={style.title}>六、免责声明</p>
          <p>
            （一）您违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户同意赔偿EVAI网使之免受损害。
            <br />
            （二）您因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的一切损失，EVAI网不承担责任。
            <br />
            （三）因技术故障等不可抗事件影响到服务的正常运行的，EVAI网承诺在第一时间内与相关单位配合，及时处理进行修复，但您因此而遭受的一切损失，EVAI网及合作单位不承担责任。
            <br />
            （四）您应妥善保管自己的账号和密码，加强密码安全性，谨防账号泄露或被盗。因用户账号被泄露或被盗而造成的任何损失，EVAI网不承担补偿责任。您因电信和网通部门的通讯线路故障、网络或电脑故障、系统不稳定、不可抗力（如服务器宕机）等非EVAI网原因造成账号、账号内财产等丢失、减少的，EVAI网不承担补偿等责任。
            <br />
            （五）您因认证信息不真实而导致账号、账号内财产等丢失、减少而无法找回的，EVAI网不承担任何法律责任。
          </p>
          <p className={style.title}>七、其他</p>
          <p>
            （一）您在登录时勾选“已阅读并同意”或具有相近意义的按钮即代表您已经阅读、理解并同意签署本协议，同时也代表您与EVAI网之间的电子协议已经成立。您充分理解并知晓，EVAI网有权在必要时修改本协议条款。您可以在EVAI网上查阅相关协议条款。
            <strong>
              本协议将根据相关法律法规的变更以及运营需要不时变更，协议变更后，如果您继续使用EVAI网提供的服务，即视为您已接受修改后的协议。
            </strong>
            <br />
            （二）本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。若您和EVAI网之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交被告所在地有管辖权的人民法院管辖。
            <br />
            （三）本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
            <br />
            （四）本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
          </p>
        </div>
      </div>
    </>
  );
};
